fdfea/Capstone_MSP432/get_time.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* Standard includes                                                          */
#include <get_time.h>
#include <stdlib.h>
#include <stdio.h>
#include <unistd.h>
#include <stdbool.h>

#include <mqueue.h>
#include <time.h>
#include <pthread.h>
#include <errno.h>

/* Simplelink includes                                                        */
#include <ti/drivers/net/wifi/simplelink.h>

/* Driverlib includes */
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>
#include <ti/devices/msp432p4xx/driverlib/aes256.h>

#include <ti/sysbios/hal/Hwi.h>

#include <ti/drivers/apps/Button.h>

/* SlNetSock includes (to enable portability to other interfaces like ETH)    */
#include <ti/drivers/net/wifi/slnetifwifi.h>

/* Common interface includes                                                  */
#include "network_if.h"
#include "uart_term.h"

/* Application includes                                                       */
#include "Board.h"
#include "pthread.h"
#include "ustdlib.h"

#include "rtc.h"
#include "SMO.h"
#include "peripherals.h"

//*****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//*****************************************************************************

/* General application functions */
void TimerPeriodicIntHandler(sigval val);
void LedTimerConfigNStart();
void LedTimerDeinitStop();
void RTC_C_IRQHandler(uintptr_t Arg);

static void *udpServerThreadProc(void *pArg);
extern void *peripheralThreadProc(void *arg0);

static void SMO_handleTimeout(void);
static void SMO_okayButtonHandler(Button_Handle handle, Button_EventMask events);
//static void SMO_buttonIRQHandler(void);
static void SMO_setButtonIRQ(void);
void PORT5_IRQHandler(void);

static int SMO_scheduleNextEvent(SMO_Control *Ctrl, uint8_t Hour, uint8_t Min);
static int SMO_handleEvent(SMO_Control *Ctrl);
static void SMO_stopEvent(void);

/****************************************************************************************************************
                   GLOBAL VARIABLES
****************************************************************************************************************/
Application_CB App_CB;
demo_Config_t       flashDemoConfigParams = { "cc3120-demo",
                                              "password",
                                              SL_WLAN_SEC_TYPE_WPA_WPA2,
                                              0xFF,
                                              "Dallas, US",
                                              0xFA,         // GMT-6
                                              0xFF }; //simplelinkapps1, ecsapps1

pthread_t gProvisioningThread   = (pthread_t) NULL;

/* AP Security Parameters */
SlWlanSecParams_t SecurityParams = { 0 };

/* Date and Time Parameters */
const uint8_t SNTPserver[30] = "time-c.nist.gov";

//RTC calendar
static volatile RTC_C_Calendar newTime;

//booleans to notify threads to stop
volatile bool udpThreadStop;
volatile bool peripheralThreadStop;

//controller for smart medication organizer
static SMO_Control SMO_Ctrl;
static pthread_mutex_t SMO_Mutex;

//handle for okay button
static Button_Handle okayButtonHandle;

//handle for button hwi
static Hwi_Handle ButtonHwi;

/* AES256 Key
 * pass=6OhmsApart
 * salt=A391991F9584AA9D
 * key=B385BB330C98AA5DFA026E2BE378BA53AFDFAFBEA5055D52C55CCECE6C1E8447
 * iv=A874759E213BD6B8FC3023FE9B1B7E57
 */
static const uint8_t AesKey256[32] = {
    0xB3, 0x85, 0xBB, 0x33, 0x0C, 0x98, 0xAA, 0x5D,
    0xFA, 0x02, 0x6E, 0x2B, 0xE3, 0x78, 0xBA, 0x53,
    0xAF, 0xDF, 0xAF, 0xBE, 0xA5, 0x05, 0x5D, 0x52,
    0xC5, 0x5C, 0xCE, 0xCE, 0x6C, 0x1E, 0x84, 0x47
};

//buffer to hold decrypted SMO_Packet
static uint8_t DataAESdecrypted[16][AES256_BLOCKSIZE];

/*
const uint8_t EncryptedPacket[3][AES256_BLOCKSIZE] = {
    { 0x59, 0x3e, 0x48, 0x1d, 0x72, 0xd8, 0xe0, 0x3f,
      0xfc, 0xce, 0x56, 0xff, 0xba, 0x3a, 0x9c, 0xcd },
    { 0xa5, 0xfd, 0xb8, 0xcb, 0x34, 0x71, 0x17, 0x0a,
      0x83, 0x84, 0x72, 0xb4, 0xf5, 0xee, 0x28, 0xc9 },
    { 0x02, 0xef, 0xea, 0x7f, 0x1d, 0x69, 0xef, 0xaa,
      0x74, 0x87, 0x3d, 0xab, 0x69, 0xa9, 0x6f, 0xad }
};
*/

/****************************************************************************************************************
                   Banner VARIABLES
****************************************************************************************************************/
char lineBreak[]                = "\n\r";

