fdfea/Capstone_MSP432/get_time.c
/****************************************************************************************************************
                 Local Functions
****************************************************************************************************************/
int32_t WiFi_IF_Connect(void);

//*****************************************************************************
//
// Push Button Handler1(GPIOSW2). Press push button1 (GPIOSW2) Whenever user
// wants to publish a message. Write message into message queue signaling the
// event publish messages
//
//*****************************************************************************
void pushButtonInterruptHandler2(uint_least8_t index)
{
    /* Disable the SW2 interrupt */
    GPIO_disableInt(Board_BUTTON0);
}

//*****************************************************************************
//
// Push Button Handler2(GPIOSW3). Press push button3 Whenever user wants to
// disconnect from the remote broker. Write message into message queue
// indicating disconnect from broker.
//
//*****************************************************************************
void pushButtonInterruptHandler3(uint_least8_t index)
{
    /* Disable the SW3 interrupt */
    GPIO_disableInt(Board_BUTTON1);
}

//*****************************************************************************
//
// Application Boarders display on UART
//
//*****************************************************************************
void printBorder(char ch, int n)
{
    int        i = 0;

    for(i=0; i<n; i++)    putch(ch);
}

//*****************************************************************************
//
// Periodic Timer Interrupt Handler
//
//*****************************************************************************
void TimerPeriodicIntHandler(sigval val)
{
    /* Increment our interrupt counter.                                       */
    App_CB.timerInts++;

    if (!(App_CB.timerInts & 0x1))
    {
        /* Turn Led Off                                                       */
        GPIO_write(Board_LED0, Board_LED_OFF);
    }
    else
    {
        /* Turn Led On                                                        */
        GPIO_write(Board_LED0, Board_LED_ON);
    }
}

//*****************************************************************************
//
// Function to configure and start timer to blink the LED while device is
// trying to connect to an AP
//
//*****************************************************************************
void LedTimerConfigNStart()
{
    struct itimerspec value;
    sigevent sev;

    /* Create Timer                                                           */
    sev.sigev_notify = SIGEV_SIGNAL;
    sev.sigev_notify_function = &TimerPeriodicIntHandler;
    timer_create(2, &sev, &App_CB.timer);

    /* start timer                                                            */
    value.it_interval.tv_sec = 0;
    value.it_interval.tv_nsec = TIMER_EXPIRATION_VALUE;
    value.it_value.tv_sec = 0;
    value.it_value.tv_nsec = TIMER_EXPIRATION_VALUE;

    timer_settime(App_CB.timer, 0, &value, NULL);
}

//*****************************************************************************
//
// Disable the LED blinking Timer as Device is connected to AP
//
//*****************************************************************************
void LedTimerDeinitStop()
{
    /* Disable the LED blinking Timer as Device is connected to AP.           */
    timer_delete(App_CB.timer);
}

//*****************************************************************************
//
// Application startup display on UART
//
//*****************************************************************************
int32_t DisplayAppBanner(char* appName, char* appVersion)
{
     int32_t            ret = 0;
     uint8_t            macAddress[SL_MAC_ADDR_LEN];
     uint16_t           macAddressLen = SL_MAC_ADDR_LEN;
     uint16_t           ConfigSize = 0;
     uint8_t            ConfigOpt = SL_DEVICE_GENERAL_VERSION;
     SlDeviceVersion_t ver = {0};

     ConfigSize = sizeof(SlDeviceVersion_t);

     /* Print device version info. */
     ret = sl_DeviceGet(SL_DEVICE_GENERAL, &ConfigOpt, &ConfigSize, (uint8_t*)(&ver));

     /* Print device Mac address */
     ret = sl_NetCfgGet(SL_NETCFG_MAC_ADDRESS_GET, 0, &macAddressLen, &macAddress[0]);

     ConfigOpt = SL_DEVICE_IOT_UDID;
     ConfigSize = sizeof(App_CB.lockUDID);

     ret = sl_DeviceGet(SL_DEVICE_IOT, &ConfigOpt, &ConfigSize, App_CB.lockUDID);

     if(ret < 0)
     {
         UART_PRINT("\t Error - Failed to get device UDID (%d)\r\n", ret);
     }

     UART_PRINT(lineBreak);
     UART_PRINT("\t");
     printBorder('=', 44);
     UART_PRINT(lineBreak);
     UART_PRINT("\t CC3120  %s Example Ver: %s",appName, appVersion);
     UART_PRINT(lineBreak);
     UART_PRINT("\t");
     printBorder('=', 44);
     UART_PRINT(lineBreak);
     UART_PRINT(lineBreak);
     UART_PRINT("\t CHIP: 0x%x",ver.ChipId);
     UART_PRINT(lineBreak);
     UART_PRINT("\t MAC:  %d.%d.%d.%d",ver.FwVersion[0],ver.FwVersion[1],ver.FwVersion[2],ver.FwVersion[3]);
     UART_PRINT(lineBreak);
     UART_PRINT("\t PHY:  %d.%d.%d.%d",ver.PhyVersion[0],ver.PhyVersion[1],ver.PhyVersion[2],ver.PhyVersion[3]);
     UART_PRINT(lineBreak);
     UART_PRINT("\t NWP:  %d.%d.%d.%d",ver.NwpVersion[0],ver.NwpVersion[1],ver.NwpVersion[2],ver.NwpVersion[3]);
     UART_PRINT(lineBreak);
     UART_PRINT("\t ROM:  %d",ver.RomVersion);
     UART_PRINT(lineBreak);
     UART_PRINT("\t HOST: %s", SL_DRIVER_VERSION);
     UART_PRINT(lineBreak);
     UART_PRINT("\t MAC address: %02x:%02x:%02x:%02x:%02x:%02x", macAddress[0], macAddress[1], macAddress[2], macAddress[3], macAddress[4], macAddress[5]);
     UART_PRINT(lineBreak);
     UART_PRINT(lineBreak);
     UART_PRINT("\t");
     printBorder('=', 44);
     UART_PRINT(lineBreak);
     UART_PRINT(lineBreak);

     return ret;
}

//*****************************************************************************
//
// This function connect the MQTT device to an AP with the SSID which was
// configured in SSID_NAME definition which can be found in Network_if.h file,
// if the device can't connect to to this AP a request from the user for other
// SSID will appear.
//
//*****************************************************************************
int32_t WiFi_IF_Connect()
{
    int32_t lRetVal;
    char SSID_Remote_Name[32];
    int8_t Str_Length;

    memset(SSID_Remote_Name, '\0', sizeof(SSID_Remote_Name));
    Str_Length = strlen(SSID_NAME);

