fdfea/Capstone_MSP432/get_time.c
    // If SSID_NAME is defined as a non-empty string, copy into SSID name buffer
    if (Str_Length)
    {
        /* Copy the Default SSID to the local variable                        */
        strncpy(SSID_Remote_Name, SSID_NAME, Str_Length);
    }

    GPIO_write(Board_LED0, Board_LED_OFF);
    GPIO_write(Board_LED1, Board_LED_OFF);
    GPIO_write(Board_LED2, Board_LED_OFF);

    /* Reset The state of the machine                                         */
    Network_IF_ResetMCUStateMachine();

    /* Start the driver                                                       */
    lRetVal = Network_IF_InitDriver(ROLE_STA);
    if (lRetVal < 0)
    {
        UART_PRINT("Failed to start SimpleLink Device\n\r", lRetVal);
        return -1;
    }

    /* switch on Green LED to indicate Simplelink is properly up.             */
    GPIO_write(Board_LED2, Board_LED_ON);

    // Start Timer to blink Red LED till AP connection
    LedTimerConfigNStart();

    /* Initialize AP security params                                          */
    SecurityParams.Key = (signed char *) SECURITY_KEY;
    SecurityParams.KeyLen = strlen(SECURITY_KEY);
    SecurityParams.Type = SECURITY_TYPE;

    /* Connect to the Access Point                                            */
    lRetVal = Network_IF_ConnectAP(SSID_Remote_Name, SecurityParams);
    if (lRetVal < 0)
    {
        UART_PRINT("Connection to an AP failed\n\r");
        return -1;
    }

    // Disable the LED blinking Timer as Device is connected to AP.
    LedTimerDeinitStop();

    // Switch ON RED LED to indicate that Device acquired an IP.
    GPIO_write(Board_LED0, Board_LED_ON);

    sleep(1);

    GPIO_write(Board_LED0, Board_LED_OFF);
    GPIO_write(Board_LED1, Board_LED_OFF);
    GPIO_write(Board_LED2, Board_LED_OFF);

    return 0;
}

static int32_t getHostIPforDate(void)
{
    int32_t status = -1;
    App_CB.timeDestinationIP = 0;

    /* Retreive IP for host based on the address */
    status = sl_NetAppDnsGetHostByName((signed char *)App_CB.timeHostName,
                                       strlen((const char*)App_CB.timeHostName),
                                       (unsigned long*)&App_CB.timeDestinationIP,
                                       SL_AF_INET);
    ASSERT_ON_ERROR(status);

    return 0;
}

static int32_t createConnectionforDate(void)
{
    int32_t sd = 0;
    struct SlTimeval_t TimeVal;

    sd = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, /*SL_IPPROTO_UDP*/ 0);
    if( sd < 0 )
    {
        UART_PRINT(" Error creating socket\n\r\n\r");
        ASSERT_ON_ERROR(sd);
    }

    TimeVal.tv_sec = TIMEOUT_SEC;
    TimeVal.tv_usec = TIMEOUT_USEC;
    sl_SetSockOpt(sd,SL_SOL_SOCKET,SL_SO_RCVTIMEO, (_u8 *)&TimeVal,sizeof(TimeVal));

    return sd;
}

static int32_t getSNTPTime(int16_t gmt_hr, int16_t gmt_min)
{
    SlSockAddrIn_t  LocalAddr;
    SlSockAddr_t Addr;

    uint8_t    dataBuf[48];
    int32_t    retVal = -1;
    int32_t    AddrSize = 0;

    /* For time zone with negative GMT value, change minutes to negative for
     * computation */
    if(gmt_hr < 0 && gmt_min > 0)
        gmt_min = gmt_min * (-1);

    memset(dataBuf, 0, sizeof(dataBuf));
    dataBuf[0] = '\x1b';

    Addr.sa_family = SL_AF_INET;
    /* the source port */
    Addr.sa_data[0] = 0x00;
    Addr.sa_data[1] = 0x7B;    /* 123 */
    Addr.sa_data[2] = (uint8_t)((App_CB.timeDestinationIP >> 24) & 0xff);
    Addr.sa_data[3] = (uint8_t)((App_CB.timeDestinationIP >> 16) & 0xff);
    Addr.sa_data[4] = (uint8_t)((App_CB.timeDestinationIP >> 8) & 0xff);
    Addr.sa_data[5] = (uint8_t) (App_CB.timeDestinationIP & 0xff);

    retVal = sl_SendTo(App_CB.timeSockID, dataBuf, sizeof(dataBuf), 0,
                     &Addr, sizeof(Addr));

    if (retVal != sizeof(dataBuf))
    {
        /* could not send SNTP request */
        UART_PRINT(" Device couldn't send SNTP request\n\r\n\r");
    }

    AddrSize = sizeof(SlSockAddrIn_t);
    LocalAddr.sin_family = SL_AF_INET;
    LocalAddr.sin_port = 0;
    LocalAddr.sin_addr.s_addr = SL_INADDR_ANY/*0*/;

    retVal = sl_RecvFrom(App_CB.timeSockID, dataBuf, sizeof(dataBuf), 0,
                       (SlSockAddr_t *)&LocalAddr,  (SlSocklen_t*)&AddrSize);
    if (retVal <= 0)
    {
        UART_PRINT(" Device couldn't receive time information \n\r");
    }

    if ((dataBuf[0] & 0x7) != 4) /* expect only server response */
    {
        /* MODE is not server, abort */
        UART_PRINT(" Device is expecting response from server only!\n\r");
    }
    else
    {
        App_CB.timeElapsedSec = dataBuf[40];
        App_CB.timeElapsedSec  <<= 8;
        App_CB.timeElapsedSec  += dataBuf[41];
        App_CB.timeElapsedSec  <<= 8;
        App_CB.timeElapsedSec  += dataBuf[42];
        App_CB.timeElapsedSec  <<= 8;
        App_CB.timeElapsedSec  += dataBuf[43];
    }

    return 0;
}

static int32_t getTime()
{
    int32_t retVal = -1;

    strcpy((char *)App_CB.timeHostName, (const char *)SNTPserver);

    retVal = getHostIPforDate();
    if(retVal < 0)
    {
        UART_PRINT(" Unable to reach Host\n\r\n\r");
        ASSERT_ON_ERROR(retVal);
    }

    App_CB.timeSockID = createConnectionforDate();
    ASSERT_ON_ERROR(App_CB.timeSockID);

    retVal = getSNTPTime(flashDemoConfigParams.gmtTimeZoneHR,
                         GMT_TIME_ZONE_MIN);
    ASSERT_ON_ERROR(retVal);

    retVal = sl_Close(App_CB.timeSockID);
    ASSERT_ON_ERROR(retVal);
    return 0;
}

static void *udpServerThreadProc(void* pArg)
{
    int32_t sd = 0;
    int32_t retVal = -1;
    SlSocklen_t ServerSize, ClientSize;
    struct SlTimeval_t TimeVal;
    SlSockAddrIn_t ServerAddr, ClientAddr;
    uint8_t DataBuf[16][16];
    int nBytes;

    sd = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, /*SL_IPPROTO_UDP*/ 0);
    if(sd < 0)
    {
        UART_PRINT("Socket create failed\n\r\n\r");
        return NULL;
    }

    TimeVal.tv_sec = 10;
    TimeVal.tv_usec = 0;
    sl_SetSockOpt(sd, SL_SOL_SOCKET, SL_SO_RCVTIMEO, (_u8 *)&TimeVal, sizeof(TimeVal));

    ServerSize = sizeof(ServerAddr);
    ServerAddr.sin_family = SL_AF_INET;
    ServerAddr.sin_port = sl_Htons(DATA_PORT);
    ServerAddr.sin_addr.s_addr = sl_Htonl(SL_INADDR_ANY);

