fdfea/Capstone_MSP432/get_time.c
    retVal = sl_Bind(sd, (SlSockAddr_t *)&ServerAddr, ServerSize);
    if (retVal < 0)
    {
        UART_PRINT("Socket bind failed\r\n");
        return NULL;
    }

    UART_PRINT("Listening on port %d...\r\n", DATA_PORT);

    while (!udpThreadStop)
    {
        ClientSize = sizeof(SlSockAddrIn_t);
        memset(&ClientAddr, 0, ClientSize);
        memset(DataBuf, 0, sizeof(DataBuf));

        nBytes = sl_RecvFrom(sd, DataBuf, sizeof(DataBuf), 0,
                             (SlSockAddr_t *)&ClientAddr, (SlSocklen_t*)&ClientSize);
        if (nBytes <= 0)
        {
            //UART_PRINT("Recieve timed out\n\r");
            continue;
        }

        UART_PRINT("Recieved %d bytes\r\n", nBytes);

        /*
         * Expected SMO Data Packet Structure
         * ======================================================
         * 1 byte -- Medication Event packet header type (0x98)
         * ------------------------------------------------------
         * 1 byte -- how many Medication Events (1-6)
         * ======================================================
         * n * (35) bytes -- array of Medication Events
         * ======================================================
         * Medication Event Data Structure
         * ======================================================
         * 1 byte -- hour to take (0-23)
         * ------------------------------------------------------
         * 1 byte -- min to take (0-59)
         * ------------------------------------------------------
         * 1 byte -- how many to take (1-5)
         * ------------------------------------------------------
         * 1 byte -- which compartment (1-6)
         * ------------------------------------------------------
         * 1 byte -- length used by medication information
         * ------------------------------------------------------
         * 30 bytes (chars) -- medication information
         * ======================================================
         */
        int Res = 0;

        //AES-256 decrypt the packet
        int nBlocks = nBytes / AES256_BLOCKSIZE + (nBytes % AES256_BLOCKSIZE != 0);
        nBlocks = nBlocks > 16 ? 16 : nBlocks;
        AES256_setDecipherKey(AES256_BASE, AesKey256, AES256_KEYLENGTH_256BIT);
        int i;
        for (i = 0; i < nBlocks; i++)
        {
            AES256_decryptData(AES256_BASE, DataBuf[i], DataAESdecrypted[i]);
        }

        //check packet type
        if (DataAESdecrypted[0][0] != SMO_PACKET_TYPE_HEADER)
        {
            UART_PRINT("Invalid packet type recieved\r\n");
            continue;
        }

        uint8_t nMeds = DataAESdecrypted[0][1];
        if (nMeds == 0 || nMeds > SMO_PACKET_MAX_MEDS)
        {
            UART_PRINT("Invalid number of meds recieved\r\n");
            continue;
        }

        //copy received data into packet
        SMO_Packet Pkt;
        memcpy(&Pkt, DataAESdecrypted, SMO_PACKET_HEADER_SIZE + nMeds*sizeof(SMO_PacketMed));

        newTime = MAP_RTC_C_getCalendarTime();

        //configure SMO from user data
        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_Control_configure(&SMO_Ctrl, &Pkt);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error configuring SMO\r\n");
            continue;
        }

        //schedule first event
        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error scheduling event\r\n");
        }
    }

    retVal = sl_Close(sd);
    if (retVal < 0)
    {
        UART_PRINT("Socket close failed\r\n");
    }
    return NULL;
}

/****************************************************************************************************************
                 Main Thread
****************************************************************************************************************/
void mainThread(void * args)
{
    int32_t retc = 0;

    /* Thread vars */
    pthread_t spawn_thread = (pthread_t) NULL;
    pthread_attr_t pAttrs_spawn;
    struct sched_param priParam;

    Button_Params  buttonParams;

    /* Peripheral parameters and handles */
    UART_Handle tUartHndl;

    /* Clear lockUDID */
    memset(&App_CB.lockUDID[0], 0x00, sizeof(App_CB.lockUDID));

    /* Initialize SlNetSock layer with CC3x20 interface */
    /*
    SlNetIf_init(0);
    SlNetIf_add(SLNETIF_ID_1, "CC3220", (const SlNetIf_Config_t *) &SlNetIfConfigWifi, SLNET_IF_WIFI_PRIO);

    SlNetSock_init(0);
    SlNetUtil_init(0);
    */

    /* Init pins used as GPIOs */
    GPIO_init();
    /* Init buttons driver */
    Button_init();
    /* Init SPI for communicating between M4 and NWP */
    SPI_init();

    /* Initialize the real-time clock */
    RTC_init();

    /* Initalize the SMO data structure */
    SMO_Control_init(&SMO_Ctrl);

    /* Configure the UART */
    tUartHndl = InitTerm();
    /* remove uart receive from LPDS dependency */
    UART_control(tUartHndl, UART_CMD_RXDISABLE, NULL);

    Button_Params_init(&buttonParams);
    okayButtonHandle = Button_open(CONFIG_BUTTON_0, SMO_okayButtonHandler, &buttonParams);

    if (okayButtonHandle == NULL)
    {
        UART_PRINT("Button open failed\r\n");
    }

    //SMO_setButtonIRQ();

    pthread_mutexattr_t Attr;
    pthread_mutexattr_init(&Attr);
    pthread_mutexattr_settype(&Attr, PTHREAD_MUTEX_RECURSIVE);
    pthread_mutex_init(&SMO_Mutex, &Attr);

    UART_PRINT("Before Wifi\r\n");

    /* Create the sl_Task */
    /*
    pthread_attr_init(&pAttrs_spawn);
    priParam.sched_priority = SPAWN_TASK_PRIORITY;
    retc |= pthread_attr_setschedparam(&pAttrs_spawn, &priParam);
    retc |= pthread_attr_setstacksize(&pAttrs_spawn, TASK_STACK_SIZE);
    retc |= pthread_attr_setdetachstate(&pAttrs_spawn, PTHREAD_CREATE_DETACHED);

    retc |= pthread_create(&spawn_thread, &pAttrs_spawn, sl_Task, NULL);
    if (retc != 0)
    {
        UART_PRINT("could not create simplelink task\n\r");
        while (1); // Insert error handling
    }
    */

    /* Started to allow host to read back MAC address when printing App banner */
    /*
    retc = sl_Start(0, 0, 0);
    if (retc < 0)
    {
        UART_PRINT("\n sl_Start failed\n");
        //while (1);// Insert error handling
    }

    //Output device information to the UART terminal
    retc = DisplayAppBanner(APPLICATION_NAME, APPLICATION_VERSION);

    retc = sl_Stop(SL_STOP_TIMEOUT);
    if (retc < 0)
    {
        UART_PRINT("\n sl_Stop failed\n");
        //while (1);
    }
    */

    /* Main application loop */
    while (1)
    {
        UART_PRINT("\n\r\n\r**** Starting main loop ****\n\r");

        App_CB.resetApplication = false;
        App_CB.initState = 0;

        /* Connect to AP */
        UART_PRINT("Using hardcoded profile for connection.\n\r");
        //App_CB.apConnectionState = WiFi_IF_Connect();

        UART_PRINT("Before peripheral thread\r\n");

