fdfea/Capstone_MSP432/get_time.c
        udpThreadStop = false;
        /*
        pthread_t udpServerThread;
        pthread_attr_t udpThreadAttr;
        pthread_attr_init(&udpThreadAttr);
        retc |= pthread_attr_setstacksize(&udpThreadAttr, TASK_STACK_SIZE);
        retc |= pthread_attr_setdetachstate(&udpThreadAttr, PTHREAD_CREATE_DETACHED);
        retc |= pthread_create(&udpServerThread, &udpThreadAttr, udpServerThreadProc, NULL);
        if (retc < 0)
        {
            UART_PRINT("UDP Server create failed\r\n");
            while (1);
        }
        */

        UART_PRINT("After peripheral thread\r\n");

        /* Initialize screen to display load screen */
        //Screen_init();

        /* Initialize LEDs */
        //LED_init();
        //LP5018_read();

        /* Initialize speaker */
        //Speaker_init();
        //Speaker_off();

        UART_PRINT("After peripheral initialization\r\n");

        /*
        retc = getTime();

        App_CB.timeElapsedSec -= TZ_EST_OFFSET_SECS;

        RTC_setTime((time_t) App_CB.timeElapsedSec);
        */

        RTC_setTime((time_t) (SECONDS_SINCE_1900 - TZ_EST_OFFSET_SECS));

        /* This can be moved */
        /*
        peripheralThreadStop = false;
        pthread_t peripheralThread;
        pthread_attr_t peripheralThreadAttr;
        pthread_attr_init(&peripheralThreadAttr);
        retc |= pthread_attr_setstacksize(&peripheralThreadAttr, TASK_STACK_SIZE);
        retc |= pthread_attr_setdetachstate(&peripheralThreadAttr, PTHREAD_CREATE_DETACHED);
        retc |= pthread_create(&peripheralThread, &peripheralThreadAttr, peripheralThreadProc, NULL);
        if (retc < 0)
        {
            UART_PRINT("peripheral Thread create failed\r\n");
            while (1);
        }
        */

        /*
        newTime = MAP_RTC_C_getCalendarTime();

        char *Date = RTC_getDate();

        Screen_updateTime(newTime.hours, newTime.minutes);
        Screen_updateDate(Date);
        */

        SMO_Packet Pkt;
        Pkt.PacketType = SMO_PACKET_TYPE_HEADER;
        Pkt.nMeds = 3;
        {
            SMO_PacketMed Med1;
            Med1.AlarmHour = 13;
            Med1.AlarmMin = 38;
            Med1.nCmptmt = 1;
            Med1.nPills = 2;
            char *MedInfo1 = "Medicine1";
            Med1.Length = strlen(MedInfo1);
            memcpy(Med1.Payload, MedInfo1, Med1.Length);

            SMO_PacketMed Med2;
            Med2.AlarmHour = 13;
            Med2.AlarmMin = 41;
            Med2.nCmptmt = 2;
            Med2.nPills = 1;
            char *MedInfo2 = "Medicine2";
            Med2.Length = strlen(MedInfo2);
            memcpy(Med2.Payload, MedInfo2, Med2.Length);

            SMO_PacketMed Med3;
            Med3.AlarmHour = 13;
            Med3.AlarmMin = 38;
            Med3.nCmptmt = 3;
            Med3.nPills = 1;
            char *MedInfo3 = "Medicine3";
            Med3.Length = strlen(MedInfo3);
            memcpy(Med3.Payload, MedInfo3, Med3.Length);

            Pkt.Meds[0] = Med1;
            Pkt.Meds[1] = Med2;
            Pkt.Meds[2] = Med3;
        }

        pthread_mutex_lock(&SMO_Mutex);
        retc = SMO_Control_configure(&SMO_Ctrl, &Pkt);
        pthread_mutex_unlock(&SMO_Mutex);
        if (retc < 0)
        {
            UART_PRINT("Error configuring SMO\r\n");
        }

        newTime = MAP_RTC_C_getCalendarTime();
        pthread_mutex_lock(&SMO_Mutex);
        retc = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (retc < 0)
        {
            UART_PRINT("Error scheduling event\r\n");
        }

        int count = 0;

        while (App_CB.resetApplication == false)
        {
            char *Date = RTC_getDate();

            UART_PRINT("Date: %s\r\n", Date);

            /*
            //AES data must be multiple of 16
            int DateLen = strlen(Date);
            int i;

            uint8_t DataBuf[DATE_BLOCKS][AES256_BLOCKSIZE];
            uint8_t EncryptedBuf[DATE_BLOCKS][AES256_BLOCKSIZE];
            uint8_t DecryptedBuf[DATE_BLOCKS][AES256_BLOCKSIZE];
            memset(DataBuf, 0, sizeof(DataBuf));
            int DataLen = (DateLen > sizeof(DataBuf)) ? sizeof(DataBuf) : DateLen;
            memcpy(DataBuf, Date, DataLen);

            UART_PRINT("AES Data: %s\r\n", (char *) DataBuf);

            AES256_setCipherKey(AES256_BASE, AesKey256, AES256_KEYLENGTH_256BIT);
            for (i = 0; i < DATE_BLOCKS; i++)
            {
                AES256_encryptData(AES256_BASE, DataBuf[i], EncryptedBuf[i]);
            }

            UART_PRINT("Encrypted Data: ");
            for (i = 0; i < sizeof(EncryptedBuf); i++)
            {
                UART_PRINT("%x", (char) EncryptedBuf[0][i]);
            }
            UART_PRINT("\r\n");

            AES256_setDecipherKey(AES256_BASE, AesKey256, AES256_KEYLENGTH_256BIT);
            for (i = 0; i < DATE_BLOCKS; i++)
            {
                AES256_decryptData(AES256_BASE, EncryptedBuf[i], DecryptedBuf[i]);
            }

            UART_PRINT("Decrypted Data: %s\r\n", (char *) DecryptedBuf);
            */

            /*
            uint8_t DecryptedBuf[3][AES256_BLOCKSIZE];

            AES256_setDecipherKey(AES256_BASE, AesKey256, AES256_KEYLENGTH_256BIT);
            int i;
            for (i = 0; i < 3; i++)
            {
                AES256_decryptData(AES256_BASE, EncryptedPacket[i], DecryptedBuf[i]);
            }

            UART_PRINT("Decrypted Data: ");
            for (i = 0; i < sizeof(DecryptedBuf); i++)
            {
                UART_PRINT("%x", DecryptedBuf[0][i]);
            }
            UART_PRINT("\r\n");
            */

            /*
            if (count % 2 == 0)
            {
                LED_allOn();
                UART_PRINT("Turned LEDs on\r\n");
            }
            else
            {
                LED_allOff();
                UART_PRINT("Turned LEDs off\r\n");
            }
            */

            /*
            char Info[50];
            sprintf(Info, "Medicine1\nMedicine2\n%d", count);
            //char *Info = "Medicine1\r\nMedicine2\r\n%d";
            Screen_printMedInfo(Info);
            */

